---
type: IFCLinkDocumentExportScope
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 3
tags: [revit-api, class]
---

# IFCLinkDocumentExportScope

`Autodesk.Revit.DB.IFC.IFCLinkDocumentExportScope` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | IFCLinkDocumentExportScope | 2024 | `public IFCLinkDocumentExportScope ( Document pADoc )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |